app/Controllers/Article.php

    public function index()
    {
        $title = "Article Lists";
        $model = new ArticleModel();
        $article = $model->findAll();
---
SELECT *
FROM `article`

    public function admin_index()
    {
        $title = "Manage Articles";
        $model = new ArticleModel();
        $article = $model->findAll();
---
SELECT *
FROM `article`