app/Controllers/User.php

    public function login()
    {
        helper(['form']);

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Jika tidak ada input email, tampilkan form login
        if (!$email) {
            return view('user/login');
        }

        $session = session();
        $model = new UserModel();
        $login = $model->where('useremail', $email)->first();
---
SELECT *
FROM `user`
WHERE `useremail` = 'admin@email.com'
 LIMIT 1